app/Models/HeroModel.php

SELECT *
FROM `hero`
WHERE `is_aktif` = 1
ORDER BY `urutan` ASC
---
    public function getAktif(): array
    {
        return $this->where('is_aktif', 1)
                    ->orderBy('urutan', 'ASC')
                    ->findAll();