app/Models/HomeModel.php

SELECT *
FROM `settings`
---
    public function getSettings(): array
    {
        $rows = $this->db->table('settings')->get()->getResultArray();

SELECT *
FROM `spmb_info`
---
    public function getSpmbInfo(): array
    {
        $rows = $this->db->table('spmb_info')->get()->getResultArray();