app/Models/PengumumanModel.php

    public function getForBeranda(int $limit = 3): array
    {
        return $this->where('is_aktif', 1)
                    ->orderBy('created_at', 'DESC')
                    ->findAll($limit);
---
SELECT *
FROM `pengumuman`
WHERE `is_aktif` = 1
ORDER BY `created_at` DESC
 LIMIT 3