app/Models/StatistikModel.php

    public function getAll(): array
    {
        return $this->orderBy('urutan', 'ASC')->findAll();
---
SELECT *
FROM `statistik`
ORDER BY `urutan` ASC